Revit 2024 API
BuiltInFailures.FamilyFailures.CannotLoadImperialFamilyToMetricProject Property
 Can't load an imperial Family into a metric Project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotLoadImperialFamilyToMetricProject { get; }
Visual Basic
Public Shared ReadOnly Property CannotLoadImperialFamilyToMetricProject As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotLoadImperialFamilyToMetricProject {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace